Repository: Korostast/Function_explorer_bot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Choose an action
ru: Выберите действие

source: Your settings Language: {} Meme: {}
ru: Ваши настройки Язык: {} Кнопка мема: {}

source: on
ru: активирована

source: off
ru: не активирована

source: Select the setting you want to apply.
ru: Выберите настройку, которую вы хотите применить

source: Enter a function you want to draw or go to the main menu
ru: Введите функцию, которую вы хотите нарисовать, или вернитесь в главное меню

source: Choose an option or enter your request or go to the main menu
ru: Выберите опцию, введите ваш запрос или вернитесь в главное меню

source: Choose option to analyse or go back
ru: Выберите опцию или вернитесь в меню

source: Enter a function to analyse or go back
ru: Введите функцию, которую хотите проанализировать, или вернитесь в меню

source: Hello, {} {}!
ru: Здравствуйте, {} {}!

source: Draw graph
ru: Нарисовать график

source: Analyse function
ru: Проанализировать функцию

source: Get help
ru: Справка

source: Meme
ru: Мем

source: Settings
ru: Настройки

source: I didn't understand what you want
ru: Не понял, что вы хотите

source: Main menu
ru: Главное меню

source: Options
ru: Опции

source: Examples
ru: Примеры

source: Choose analysis example
ru: Выберите пример анализа

source: Back
ru: Назад

source: Enter a function to explore or go back
ru: Введите функцию, которую хотите проанализировать, или вернитесь в меню

source: Choose graph example
ru: Выберите пример графика

source: On meme button
ru: Активировать кнопку мема

source: Off meme button
ru: Деактивировать кнопку мема

source: Set en language
ru: Установить en язык

source: Set ru language
ru: Установить ru язык

source: Settings saved
ru: Настройки сохранены

source: Choose graph examples
ru: Выберите пример графика

source: Choose analysis examples
ru: Выберите пример анализа

source: Task in work...
ru: Решаю задачу...

source: Function execution time limit exceeded! Sorry, it is a very hard problem to solve.
ru: Превышен лимит времени выполнения функции! Извините, это очень трудно решаемая задача.

source: Here a graph of requested functions
ru: Вот ваш график

source: Couldn't find a suitable template. Check the input.
ru: Не удалось найти подходящий шаблон. Проверьте входные данные.

source: Photo size is too large, therefore I send you a file.
ru: Размер фотографии слишком большой, поэтому я отправлю ответ в виде файла.

source: Incorrect input. Please check your function.
ru: Некорректный ввод. Пожалуйста, проверьте вашу функцию.

source: Sorry, can't solve the problem or the input is invalid. Please check your function.
ru: Извините, не могу решить задачу, либо ввод некорректный. Пожалуйста, проверьте вашу функцию.

source: Sorry, something went wrong. Please try again later.
ru: Извините, что-то пошло не так. Пожалуйста, повторите попытку позже.

source: *General information:* Our bot knows how to draw graphs based on a given expression, with the ability to specify parameters such as area of definition (domain), area of value (range), and aspect ratio. If you don't want to read the tons of words, you can use the "Examples" button to figure out for yourself how the bot works. You can use buttons to interact with the bot, or you can use commands that work everywhere and always.
ru: *Общая информация:* Наш бот умеет рисовать графики по заданному выражению с возможностью указать параметры, такие как область определения, область значений и соотношение сторон. Если не горите желанием читать буквы, то можете воспользоваться кнопкой "Примеры" и сообразить самим, как это всё работает. Вы можете использовать кнопки для взаимодействия с ботом, либо команды, которые работают везде и всегда.

source: *Quick start:* `/graph function1, function2, ..., parameter1, parameter2, ...` — draws the functions f(x) or y = f(x), or f(x, y) = const on a single graph with the given parameters listed separated by commas. Functions are given in mathematical form. Sometimes functions can have brackets and multiplication omitted. Example: `/graph y = 2x, x^2 + y^2 = 16, sin x, sqrt x, x = (-20, 20), y = (-10, 10)` The bot may not always accurately draw the graph or define its area of definition and range, so you can specify them manually via parameters.
ru: *Краткий гайд:* `/graph функция1, функция2, ..., параметр1, параметр2, ...` — рисует на одном графике функции f(x) или y = f(x), или f(x, y) = const с заданными параметрами, перечисленными через запятую. Функции задаются в математическом виде. Иногда у функций можно опускать скобки и умножение. Пример: `/graph y = 2x, x^2 + y^2 = 16, sin x, sqrt x, x = (-20, 20), y = (-10, 10)` Бот может не всегда точно нарисовать график или определить его область определения и значений, поэтому вы можете указать их вручную через параметры.

source: *Parameters:* — `Domain` — you can specify the values of the argument (the 'x' variable), for example: `x from -5 to 10, x in [0, 24.5], for x = (10, 20)`, etc. — `Range` — you can specify the values of the function (variable 'y') in the same way as the area of definition, for example: `for y from -5 to 0, y in (0, 1.2), y=(10, 20)`, etc. — `Aspect ratio` — it is allowed to set the ratio of the chart's width to its height, for example: `aspect ratio = 1, ratio=1, ratio = 0.5` и т.д. Can be useful for drawing circles.
ru: *Параметры:* — `Область определения` — можно указывать значения аргумента (переменной 'x'), например: `x from -5 to 10, x in [0, 24.5], for x = (10, 20)` и т.д. — `Область значений` — можно указывать значения функции (переменной 'y') так же, как и область определения, например: `for y from -5 to 0, y in (0, 1.2), y=(10, 20)` и т.д. — `Соотношение сторон графика` — допускается устанавливать соотношение ширины к высоте графика, например: `aspect ratio = 1, ratio=1, ratio = 0.5` и т.д. Бывает полезно при рисовании окружностей.

source: *General information:* Our bot knows how to analyse functions by a query written in English. If you don't want to read the tons of words, you can use the "Examples" button to figure out for yourself how the bot works. You can use buttons to interact with the bot, or you can use commands that work everywhere and always.
ru: *Общая информация:* Наш бот умеет анализировать функции по запросу, написанному на английском языке. Если не горите желанием читать буквы, то можете воспользоваться кнопкой "Примеры" и сообразить самим, как это всё работает. Вы можете использовать кнопки для взаимодействия с ботом, либо команды, которые работают везде и всегда.

source: *Quick start:* `/analyse option` — tries to understand the query and output an answer for the function specified in the query. Queries have their own patterns, but in general natural English is implied. The function must be in mathematical form. Sometimes functions can have brackets and multiplication omitted. Examples: `/analyse domain of 2 sqrt x` `/analyse diff 2 a^4 b c^2 by b, a` `/analyse is function sin 4x even?` etc. Due to the fact that it is quite difficult to give an exact answer to any problem, the bot may make a mistake or not even solve the problem. Be tolerant of the handicapped. See "Examples" for clarity.
ru: *Краткий гайд:* `/analyse option` — пытается понять запрос и выдать на него ответ для указанной в запросе функции. Запросы имеют свои шаблоны, но в целом подразумевается естественный *английский* язык. Функция должна быть в математическом виде. Иногда у функций можно опускать скобки и умножение. Примеры: `/analyse domain of 2 sqrt x` `/analyse diff 2 a^4 b c^2 by b, a` `/analyse is function sin 4x even?` и т.д. Ввиду того, что дать точный ответ на любые задачи довольно сложно, бот может ошибиться или даже не решить задачу. Будьте толерантны к инвалидам. Смотрите "Примеры" для наглядности.

source: *Options:* Available options for function analysis. Some words can be abbreviated or replaced with synonyms - the bot will try to understand you: - Derivative - Domain - Range - Function zeros - Intersection with axes - Periodicity - Convexity - Concavity - Vertical asymptotes - Horizontal asymptotes - Slant asymptotes - All Asymptotes - Evenness - oddness - Maximum - Minimum - Critical points - Monotonicity
ru: *Опции:* Доступные опции для анализа функции. В скобках указаны *один из* английских вариантов-переводов, который понимает бот. Некоторые слова можно сокращать или заменять синонимами - бот постарается понять вас: — Производная (derivative) — Область определения (domain) — Область значений (range) — Нули функции (zeros) — Пересечение с осями координат (intersection with axes) — Периодичность (periodicity) — Выпуклость (convexity) — Вогнутость (concavity) — Вертикальные асимптоты (vertical asymptotes) — Горизонтальные асимптоты (horizontal asymptotes) — Наклонные асимптоты (slant asymptotes) — Все асимптоты (asymptotes) — Чётность (evenness) — Нечётность (oddness) — Максимальное значение (max) — Минимальное значение (min) — Стационарные точки (critical points) — Монотонность (monotonicity)

source: Graph guide
ru: Гайд по графикам

source: Analysis guide
ru: Гайд по анализу

source: Graph examples
ru: Примеры графиков

source: Analysis examples
ru: Примеры анализа

source: Set {} language
ru: Установить {} язык

source: {} meme button
ru: {} кнопку мема

source: Off
ru: Деактивировать

source: On
ru: Активировать

source: Derivative
ru: Производная

source: Domain
ru: Область определения

source: Range
ru: Область значений

source: Stationary points
ru: Стационарные точки

source: Periodicity
ru: Периодичность

source: Monotonicity
ru: Монотонность

source: Convexity
ru: Выпуклость

source: Concavity
ru: Вогнутость

source: Asymptotes
ru: Асимптоты

source: Vertical asymptotes
ru: Вертикальные асимптоты

source: Slant asymptotes
ru: Наклонные асимптоты

source: Horizontal asymptotes
ru: Гориз. асимптоты

source: Oddness
ru: Нечётность

source: Axes intersection
ru: Пересечения с осями

source: Evenness
ru: Чётность

source: Maximum
ru: Максимум

source: Minimum
ru: Минимум

source: Zeros
ru: Нули

source: Mistake in implicit function: found more than 1 equal sign. Your input: {} Please, check your math formula.
ru: Ошибка в неявно заданной функции: в выражении больше одного знака равно. Ваш ввод: {} Пожалуйста, проверьте введённую функцию.

source: Mistake in expression. Your input: {} Please, check your math formula.
ru: Ошибка в выражении. Ваш ввод: {} Пожалуйста, проверьте введённую функцию.

source: Couldn't make out the expression. Your input: {} Try using a stricter syntax, such as placing '*' (multiplication) signs and parentheses.
ru: Не получилось разобрать выражение. Ваш ввод: {} Попробуйте использовать более строгий синтаксис, например, расставлять знаки '*' (умножение) и круглые скобки.

source: Variables can only contain latin letters Incorrect variable: '{}'
ru: Переменные могут содержать только латинские буквы. Некорректная переменная: '{}'

source: of
ru: функции

source: by
ru: по

source: For
ru: Для

source: function
ru: функции

source: Intersection
ru: Пересечение

source: with
ru: с

source: axis
ru: осью

source: Is
ru: Является ли

source: convex
ru: выпуклой

source: concave
ru: вогнутой

source: Vertical
ru: Вертикальные

source: asymptotes
ru: асимптоты

source: Horizontal
ru: Горизонтальные

source: Slant
ru: Наклонные

source: even
ru: чётной

source: odd
ru: нечётной

source: Max
ru: Наибольшее

source: value
ru: значение

source: Min
ru: Наименьшее

source: Stationary
ru: Стационарные

source: points
ru: точки

source: Unknown pattern set: {}
ru: Неизвестный шаблон: {}

source: Variables can only contain letters Incorrect variable: '{}'
ru: Переменные могут содержать только латинские буквы Некорректная переменная: '{}'

source: Yes
ru: Да

source: No
ru: Нет

source: Plot
ru: График

source: NOTE: some of the functions are extremely long! Graph may be incorrect.
ru: ПРЕДУПРЕЖДЕНИЕ: некоторые функции очень длинные! График может быть построен неправильно.

source: Unexpected error, check your expression.
ru: Неожиданная ошибка, проверьте введённые данные.

source: Some functions have been reduced because they are too long.
ru: Некоторые функции были сокращены из-за их чрезмерной длины.

source: Incorrect bracket sequence. Check your expression.
ru: Неправильная скобочная последовательность. Проверьте выражение.

source: Mistake in function {} parameters. Your input: {} Please, check if numbers are correct.
ru: Ошибка в параметрах функции {}. Ваш ввод: {} Пожалуйста, проверьте, что все введённые числа корректны.

source: Mistake in function {} parameters. Your input: {} Left argument cannot be more or equal than right one: {} >= {}.
ru: Ошибка в параметрах функции {}. Ваш ввод: {} Левый аргумент не может быть больше или равен правому: {} >= {}.

source: Mistake in aspect ratio. Your input: {} Please, check if number is correct.
ru: Ошибка в параметре соотношения сторон. Ваш ввод: {} Пожалуйста, проверьте, что числа корректны.

source: Mistake in aspect ratio. Your input: {} Aspect ratio cannot be negative or equal to zero.
ru: Ошибка в параметре соотношения сторон. Ваш ввод: {} Соотношение сторон не может быть отрицательным или равным нулю.

source: Variable '{}' is replaced by 'y'
ru: Переменная '{}' заменена на 'y'

source: Variable '{}' is replaced by 'x'
ru: Переменная '{}' заменена на 'x'

source: Variable '{}' is replaced by 'y', variable '{}' is replaced by 'x'
ru: Переменная '{}' заменена на 'y', переменная '{}' заменена на 'x'

source: Incorrect expression: {} There is only 'y' variable. It's f(y) or f(x) = 0? Please, use 'x' instead of single 'y' variable for f(x) plot.
ru: Некорректное выражение: {} В нём только переменная 'y'. Это f(y) или f(x) = 0? Пожалуйста, используйте 'x' вместо единственной переменной 'y' для построения графика f(x).

source: Incorrect expression: {} There are {} variables: {} You can use a maximum of 2 variables.
ru: Некорректное выражение: {} В формуле {} переменных: {} Допускается использование не более двух переменных.

source: Result of expression '{}' is always {}
ru: Результат выражения '{}' всегда {}

source: Mistake in implicit function: found more than 1 equal sign. Your input: {} Please, check your math formula
ru: Ошибка в неявно заданной функции: в выражении больше одного знака равно. Ваш ввод: {} Пожалуйста, проверьте введённую функцию.

source: Cannot resolve a statement: {}
ru: Не удалось разобрать выражение: {}

source: Too many functions requested ({}). The limit is {} functions.
ru: Запрошено слишком много функций ({}). Ограничение - {} функций.

source: Enter: /start to restart bot. /graph to draw a graph. /analyse to go on to investigate the function.
ru: Введите: /start для перезапуска бота. /graph для построения графиков. /analyse чтобы перейти к исследованию функций.

source: Since there is more than one variable in the expression, the variable(s) of differentiation must be supplied to differentiate
ru: Поскольку в выражении имеется более одной переменной, для дифференцирования необходимо указать переменную(ые), по которой требуется произвести дифференцирование

source: Aperiodic function
ru: Апериодическая функция

source: Function is constant (any period)
ru: Функция постоянна (любой период)

source: Strictly decreasing
ru: Строго убывающая

source: Strictly increasing
ru: Строго возрастающая

source: Increasing
ru: Возрастающая

source: Decreasing
ru: Убывающая

source: Non-monotonic
ru: Немонотонная

source: Interpreting '{}' as '{}'
ru: '{}' исправлено на '{}'

source: Flood is not allowed! You should wait {} seconds to repeat this action.
ru: Флуд запрещен! Вы должны подождать {} секунд, чтобы повторить это действие.
